# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_resource_group.rg_dp_stag: Read complete after 0s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_client_config.current: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_resource_group.rg_studio_prod: Read complete after 0s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 2s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_studio_dev: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_stag: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.grafana_k8s_monitoring will be created
  + resource "helm_release" "grafana_k8s_monitoring" {
      + atomic                     = false
      + chart                      = "k8s-monitoring"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "k8s-monitoring"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # https://github.com/grafana/k8s-monitoring-helm/blob/main/charts/k8s-monitoring/README.md
                ---
                cluster:
                  name: "k6tests-cluster"
                
                destinations:
                  - name: loki
                    type: loki
                    url: http://loki-gateway.monitoring.svc.cluster.local/loki/api/v1/push
                    auth:
                      type: basic
                      usernameKey: username
                      passwordKey: password
                    secret:
                      create: false
                      name: canary-basic-auth
                      namespace: monitoring
                
                clusterEvents:
                  enabled: true
                  collector: alloy-logs
                  # namespaces:
                
                nodeLogs:
                  enabled: false
                
                podLogs:
                  enabled: true
                  gatherMethod: kubernetesApi
                  collector: alloy-logs
                  # namespaces:
                
                # Collectors
                alloy-singleton:
                  enabled: false
                
                alloy-metrics:
                  enabled: false
                
                alloy-logs:
                  enabled: true
                  # Required when using the Kubernetes API to pod logs
                  alloy:
                    mounts:
                      varlog: false
                    clustering:
                      enabled: true
                
                alloy-profiles:
                  enabled: false
                
                alloy-receiver:
                  enabled: false
            EOT,
        ]
      + verify                     = false
      + version                    = "3.1.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.k6_operator will be updated in-place
  ~ resource "helm_release" "k6_operator" {
      ~ id                         = "k6-operator" -> (known after apply)
      ~ lint                       = false -> true
      ~ metadata                   = {
          ~ app_version    = "0.0.22" -> (known after apply)
          ~ chart          = "k6-operator" -> (known after apply)
          ~ first_deployed = 1733489406 -> (known after apply)
          ~ last_deployed  = 1753258997 -> (known after apply)
          ~ name           = "k6-operator" -> (known after apply)
          ~ namespace      = "k6-operator-system" -> (known after apply)
          ~ notes          = <<-EOT
                Thank you for installing k6-operator.
                
                Your release is named k6-operator.
                
                To learn more about the release, try:
                
                  $ helm status k6-operator
                  $ helm get all k6-operator
            EOT -> (known after apply)
          ~ revision       = 6 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - installCRDs = true
                  - namespace   = {
                      - create = false
                    }
                }
            ) -> (known after apply)
          ~ version        = "3.14.2" -> (known after apply)
        } -> (known after apply)
        name                       = "k6-operator"
        # (27 unchanged attributes hidden)
    }

  # helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
      ~ id                         = "kube-prometheus-stack" -> (known after apply)
      ~ lint                       = false -> true
      ~ metadata                   = {
          ~ app_version    = "v0.83.0" -> (known after apply)
          ~ chart          = "kube-prometheus-stack" -> (known after apply)
          ~ first_deployed = 1733406099 -> (known after apply)
          ~ last_deployed  = 1753259017 -> (known after apply)
          ~ name           = "kube-prometheus-stack" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                The exposed metrics can be found here:
                https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                
                The metrics are exported on the HTTP endpoint /metrics on the listening port.
                In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                
                They are served either as plaintext or protobuf depending on the Accept header.
                They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                  echo "Visit http://127.0.0.1:9100 to use your application"
                  kubectl port-forward --namespace monitoring $POD_NAME 9100
                kube-prometheus-stack has been installed. Check its status by running:
                  kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                
                Get Grafana 'admin' user password by running:
                
                  kubectl --namespace monitoring get secrets kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                
                Access Grafana local instance:
                
                  export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -oname)
                  kubectl --namespace monitoring port-forward $POD_NAME 3000
                
                Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
            EOT -> (known after apply)
          ~ revision       = 23 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - alertmanager = {
                      - enabled = true
                    }
                  - crds         = {
                      - enabled = false
                    }
                  - grafana      = {
                      - enabled = false
                    }
                  - prometheus   = {
                      - enabled        = true
                      - prometheusSpec = {
                          - enableRemoteWriteReceiver = true
                          - externalLabels            = {
                              - cluster = "k6tests-cluster"
                            }
                          - nodeSelector              = {
                              - prometheus = "true"
                            }
                          - podMetadata               = {
                              - labels = {
                                  - "azure.workload.identity/use" = "true"
                                }
                            }
                          - priorityClassName         = "system-cluster-critical"
                          - remoteWrite               = [
                              - {
                                  - azureAd = {
                                      - cloud = "AzurePublic"
                                      - sdk   = {
                                          - tenantId = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                                        }
                                    }
                                  - url     = "https://k6tests-amw-0vej.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-81e9cf1b38fb4648b047399c5593ebda/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                                },
                            ]
                          - resources                 = {
                              - requests = {
                                  - memory = "8Gi"
                                }
                            }
                          - retention                 = "8d"
                          - storageSpec               = {
                              - volumeClaimTemplate = {
                                  - spec = {
                                      - resources = {
                                          - requests = {
                                              - storage = "64Gi"
                                            }
                                        }
                                    }
                                }
                            }
                          - tolerations               = [
                              - {
                                  - effect   = "NoSchedule"
                                  - key      = "workload"
                                  - operator = "Equal"
                                  - value    = "prometheus"
                                },
                            ]
                        }
                      - serviceAccount = {
                          - annotations = {
                              - "azure.workload.identity/client-id" = "c4eeeead-8978-41a4-a989-e6e4aa9df603"
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "75.12.0" -> (known after apply)
        } -> (known after apply)
        name                       = "kube-prometheus-stack"
        # (27 unchanged attributes hidden)
    }

  # helm_release.loki will be created
  + resource "helm_release" "loki" {
      + atomic                     = false
      + chart                      = "loki-distributed"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                loki:
                   podLabels:
                    "azure.workload.identity/use": "true"
                   schemaConfig:
                     configs:
                       - from: "2024-04-01"
                         store: tsdb
                         object_store: azure
                         schema: v13
                         index:
                           prefix: loki_index_
                           period: 24h
                   storage_config:
                     azure:
                      account_name: "k6clusterlokisa"
                      container_name: "k6cluster-loki-chunks"
                      use_federated_token: true
                   ingester:
                       chunk_encoding: snappy
                   pattern_ingester:
                       enabled: true
                   limits_config:
                     allow_structured_metadata: true
                     volume_enabled: true
                     retention_period: 672h # 28 days retention
                   compactor:
                     retention_enabled: true 
                     delete_request_store: azure
                   ruler:
                    enable_api: true
                    storage:
                      type: azure
                      azure:
                        account_name: "k6clusterlokisa"
                        container_name: "k6cluster-loki-ruler"
                        use_federated_token: true
                
                   querier:
                      max_concurrent: 4
                
                   storage:
                      type: azure
                      bucketNames:
                        chunks: "k6cluster-loki-chunks"
                        ruler: "k6cluster-loki-ruler"
                      azure:
                        accountName: "k6clusterlokisa"
                        useFederatedToken: true
                
                # Define the Azure workload identity
                serviceAccount:
                  name: loki
                  annotations:
                    "azure.workload.identity/client-id": "178f9a67-6c3c-46d1-956d-5f8107ebc11a"
                  labels:
                    "azure.workload.identity/use": "true"
                
                deploymentMode: Distributed
                
                ingester:
                 replicas: 3
                 zoneAwareReplication:
                  enabled: false
                
                querier:
                 replicas: 3
                 maxUnavailable: 2
                
                queryFrontend:
                 replicas: 2
                 maxUnavailable: 1
                
                queryScheduler:
                 replicas: 2
                
                distributor:
                 replicas: 3
                 maxUnavailable: 2
                compactor:
                 replicas: 1
                
                indexGateway:
                 replicas: 2
                 maxUnavailable: 1
                
                ruler:
                 replicas: 1
                 maxUnavailable: 1
                
                
                # This exposes the Loki gateway so it can be written to and queried externaly
                gateway:
                 service:
                   type: LoadBalancer
                 basicAuth: 
                     enabled: true
                     existingSecret: loki-basic-auth
                
                # Since we are using basic auth, we need to pass the username and password to the canary
                lokiCanary:
                  extraArgs:
                    - -pass=$(LOKI_PASS)
                    - -user=$(LOKI_USER)
                  extraEnv:
                    - name: LOKI_PASS
                      valueFrom:
                        secretKeyRef:
                          name: canary-basic-auth
                          key: password
                    - name: LOKI_USER
                      valueFrom:
                        secretKeyRef:
                          name: canary-basic-auth
                          key: username
                
                # Enable minio for storage
                minio:
                 enabled: false
                
                backend:
                 replicas: 0
                read:
                 replicas: 0
                write:
                 replicas: 0
                
                singleBinary:
                 replicas: 0
            EOT,
        ]
      + verify                     = false
      + version                    = "0.80.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.prometheus_operator_crds will be updated in-place
  ~ resource "helm_release" "prometheus_operator_crds" {
      ~ id                         = "prometheus-operator-crds" -> (known after apply)
      ~ lint                       = false -> true
      ~ metadata                   = {
          ~ app_version    = "v0.84.0" -> (known after apply)
          ~ chart          = "prometheus-operator-crds" -> (known after apply)
          ~ first_deployed = 1733406085 -> (known after apply)
          ~ last_deployed  = 1753258997 -> (known after apply)
          ~ name           = "prometheus-operator-crds" -> (known after apply)
          ~ namespace      = "default" -> (known after apply)
          + notes          = (known after apply)
          ~ revision       = 9 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "22.0.1" -> (known after apply)
        } -> (known after apply)
        name                       = "prometheus-operator-crds"
        # (26 unchanged attributes hidden)
    }

  # helm_release.pyrra will be updated in-place
  ~ resource "helm_release" "pyrra" {
      ~ id                         = "pyrra" -> (known after apply)
      ~ lint                       = false -> true
      ~ metadata                   = {
          ~ app_version    = "v0.8.1" -> (known after apply)
          ~ chart          = "pyrra" -> (known after apply)
          ~ first_deployed = 1733740610 -> (known after apply)
          ~ last_deployed  = 1750861931 -> (known after apply)
          ~ name           = "pyrra" -> (known after apply)
          ~ namespace      = "pyrra-system" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace pyrra-system -l "app.kubernetes.io/name=pyrra,app.kubernetes.io/instance=pyrra" -o jsonpath="{.items[0].metadata.name}")
                  export CONTAINER_PORT=$(kubectl get pod --namespace pyrra-system $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                  echo "Visit http://127.0.0.1:8080 to use your application"
                  kubectl --namespace pyrra-system port-forward $POD_NAME 8080:$CONTAINER_PORT
            EOT -> (known after apply)
          ~ revision       = 3 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - genericRules = {
                      - enabled = true
                    }
                }
            ) -> (known after apply)
          ~ version        = "0.14.3" -> (known after apply)
        } -> (known after apply)
        name                       = "pyrra"
        # (27 unchanged attributes hidden)
    }

  # helm_release.sealed_secrets will be updated in-place
  ~ resource "helm_release" "sealed_secrets" {
      ~ id                         = "sealedsecrets" -> (known after apply)
      ~ lint                       = false -> true
      ~ metadata                   = {
          ~ app_version    = "0.30.0" -> (known after apply)
          ~ chart          = "sealed-secrets" -> (known after apply)
          ~ first_deployed = 1733733169 -> (known after apply)
          ~ last_deployed  = 1750861931 -> (known after apply)
          ~ name           = "sealedsecrets" -> (known after apply)
          ~ namespace      = "sealedsecrets-system" -> (known after apply)
          ~ notes          = <<-EOT
                ** Please be patient while the chart is being deployed **
                
                You should now be able to create sealed secrets.
                
                1. Install the client-side tool (kubeseal) as explained in the docs below:
                
                    https://github.com/bitnami-labs/sealed-secrets#installation-from-source
                
                2. Create a sealed secret file running the command below:
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o [json|yaml] |                     kubeseal                       --controller-name=sealedsecrets-sealed-secrets                       --controller-namespace=sealedsecrets-system                       --format yaml > mysealedsecret.[json|yaml]
                
                The file mysealedsecret.[json|yaml] is a commitable file.
                
                If you would rather not need access to the cluster to generate the sealed secret you can run:
                
                    kubeseal                       --controller-name=sealedsecrets-sealed-secrets                       --controller-namespace=sealedsecrets-system                       --fetch-cert > mycert.pem
                
                to retrieve the public cert used for encryption and store it locally. You can then run 'kubeseal --cert mycert.pem' instead to use the local cert e.g.
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o [json|yaml] |                     kubeseal                       --controller-name=sealedsecrets-sealed-secrets                       --controller-namespace=sealedsecrets-system                       --format [json|yaml] --cert mycert.pem > mysealedsecret.[json|yaml]
                
                3. Apply the sealed secret
                
                    kubectl create -f mysealedsecret.[json|yaml]
                
                Running 'kubectl get secret secret-name -o [json|yaml]' will show the decrypted secret that was generated from the sealed secret.
                
                Both the SealedSecret and generated Secret must have the same name and namespace.
            EOT -> (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "2.17.3" -> (known after apply)
        } -> (known after apply)
        name                       = "sealedsecrets"
        # (26 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`